In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'Groups':['A','B','C','A','B','C'],
    'Variable_1':[10,23,33,22,11,99],
    'Variable_2':[100,253,333,262,111,969]},
    columns=['Groups','Variable_1','Variable_2'])
df

  Groups  Variable_1  Variable_2
0      A          10         100
1      B          23         253
2      C          33         333
3      A          22         262
4      B          11         111
5      C          99         969

In [3]:
df["Variable_1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: Variable_1, dtype: int64

In [7]:
df_a = df.iloc[:,1:3]

df_a.transform(lambda x: x-x.mean())

#Archaic Struct :(

   Variable_1  Variable_2
0       -23.0      -238.0
1       -10.0       -85.0
2         0.0        -5.0
3       -11.0       -76.0
4       -22.0      -227.0
5        66.0       631.0

In [9]:
df = pd.DataFrame({
    'Variable_1':[10,23,33,22,11,99],
    'Variable_2':[100,253,333,262,111,969]},
    columns=['Variable_1','Variable_2'])
df

   Variable_1  Variable_2
0          10         100
1          23         253
2          33         333
3          22         262
4          11         111
5          99         969

In [10]:
df.apply(np.sum)

Variable_1     198
Variable_2    2028
dtype: int64

In [11]:
df.apply(np.mean)

Variable_1     33.0
Variable_2    338.0
dtype: float64

In [12]:
df = pd.DataFrame({
    'Groups':['A','B','C','A','B','C'],
    'Variable_1':[10,23,33,22,11,99],
    'Variable_2':[100,253,333,262,111,969]},
    columns=['Groups','Variable_1','Variable_2'])
df

  Groups  Variable_1  Variable_2
0      A          10         100
1      B          23         253
2      C          33         333
3      A          22         262
4      B          11         111
5      C          99         969

In [13]:
df.groupby("Groups").apply(np.sum)

       Groups  Variable_1  Variable_2
Groups
A          AA          32         362
B          BB          34         364
C          CC         132        1302